a= input("Привет как тебя зовут")
print("Рад познакомится", a)

b= input("Ты готов начать своё путишествие ?")
if b== 'да':
    print("Тогда начнём")
else:
    print("Тогда ступай и не топчи здесь")
    exit()

print("Давным давно, здесь не было моей избушки а был город настояший и большой"
      "Но он был окутан тайной и страхомю"
      "Все обходили его стороной."
      "ПОКА ОДНАЖДЫ"
      "НЕЧТО НЕ ОТКРЫЛО ВРАТА"
      "Из врат полетала всякая нечесть и монстры"
      "Тогда вышел ОН"
      "Теперь каждый год ЕМУ должны приносить жертву"
      "Но ты, ты можешь ЕГО остановить")

vibor1= input("Готов ли ты стать отважным героем или нет ?")

if vibor1== 'да':
    print("Хорошо")
else:
    print("Ну и проваливай")
    exit()

print("Ты начинаешь свой путь в старом автобобиле. Ты детектив Эвен который решает узнать что случилось с некогда хорошим городом. Но как только ты вехал в город машина заглохла и тебе пришлось топать пешком.")
print("Ты идёшь по оживлнным некогда улицам города в полной тишене окутаный туманом.")
print("Лишь лёгкий ветерок теребит твой плащь а оставшейся люди смотрят на тебя через окно.")
print("Ты толком не знаешь куда идёшь ты просто ходишь по пустым улицам где проходет один или два человека.")

vibor2= input("Ты видишь супер маркет зайдёшь в него ?")
if vibor2== 'да':
    print("Ты заходишь в супер маркет")
else:
    print("Ты решаешь пропустить его. А ЗРЯ. ОНО НАСТИГЛО ТЕБЯ")
    exit()

print("На удевления в супермаркете было достаточно ожевлённо примерно человек 10 15 но они быстро уходили и уходили.")
vibor3= input("Ты решаешь подойти к человеку и спросить что происходит. Ты это сделаешь ?")
if vibor3== 'да':
    print("Ты спрашеваешь у него что случилось")
else:
    print("НЕЧТО СЛЕДИТ ЗА ТВОИМИ ШАГАМИ ТЫ ЕГО РАССТРАИВАЕШЬ")
    exit()

print("В ходе беседы то понимаешь что скоро будет тот самый день жертво приношения ЕМУ")
print("ТЫ решаешь както помешать процесу")
print("Человек рассказал что жертво приношение можно остановить и закрыть врата и беды")
print("Но этот человек не помнит что и когда нужно сделать чтобы прервать жертво приношение")
print("Но он рассказал что есть книга где есть прарочество где рассказывается как прервать жертво приношение.")
print("А книга хранится в библиотеке")
print("Потом вы попрошялись с человеком и ты пошёл дальше")
print("Ты решил пойти в библиотеку. Ты идёшь спрашивая у жиьелей которые проходят мимо")
print("Хотя ты спросил только у одного и уже идёшь дальше")
print("Ты добрался до библиотеки")

vibor4= input("Зайдёшь в неё ?")
if vibor4== 'да':
    print("Ты зашёл в библиотеку")
else:
    print("НЕ СТОИТ ЕГО ЗЛИТЬ")

print("В библиотеке вы спросили про книгу вам ответели что такой нет")
print("Но ты детектив с большим стажем и поэтому понял что тебе врут")
print("Но как только ты хотел сказать что тебе врут в здание зашёл полицейский")
print("Он попросил тебя пройти с ним и ты пошёл за ним как вдруг")
print("БАМ")
print("*Ты потерял сознание")
print("Очнулся только на на стуле с ярким светом в глазах")
print("*Ты на допросе")
print("- Так что-же тебе дома не седится- Обратился к тебе полицейский")
print("- А вы не понимайте ? Этот город гнеёт. Культисты, врата, монстры выходяшие каждую ночь- Отвечал ты")
print("- Что-ж удаче тебе")
print("Полицейский начал злиться")
print("МЕХАНИКА: Злость - у каждого человека есть злость которая копится в человеке если не успокоить его он может активировать ярость. В ярости человек начинает агресировать. Может активироватся полная разерённость, тогда человек нападёт на вас. Конец описания")
print("- Что ? и вы ничего не делайте- Спрашиваешь ты")
print("- А ЧТО НАМ ДЕЛАТЬ ПО ТВОЕМУ. ДУМАЕШЬ МЫ НЕ ПРОБАВАЛИ. МОНСТРЫ ДУМАЕШЬ ОТ ПАТРОНОВ ЛОЖАТСЯ")
print("Полицейский в ЯРОСТИ")
print("- И вы бросили это дело вот так ? Обречая столько невинных душ на смерть ?")
print("ПОЛИЦЕЙСКИЙ В ПОЛНОЙ РАЗЕРЁННОСТИ")
print("начинается БОЙ")
print("МЕХАНИКА: Бой - нажимайте кнопки которые будут сказаны во время боя чтобы атаковать, контр-атаковать, защищатся")
boy1= input("Поличейский атакует сильным ударом защита клавиша d ")
if boy1== 'd':
    print("Вы увернулись от сильной атаки")
else:
    print("Удар оказалься настолько сильным что вы были повалены с ног. Полицейский убил вас")
    exit()
